#include <REGX52.H>


//配置寄存器
void Timer0_Init()
{
//100微秒@12.000MHz
	TMOD &= 0xF0;			//设置定时器模式
	TMOD |= 0x01;			//设置定时器模式
	TL0 = (65535-200)%256;				//设置定时初始值
	TH0 = (65535-200)/256;				//设置定时初始值
	TF0 = 0;				//清除TF0标志
	TR0 = 1;				//定时器0开始计时
	ET0=1;       //定时器0使能中断
	EA=1;        //使能总开关 必须为1才能有定时器工作
	PT0=0;        //设置中断优先级
}


//中断函数模板
//void Timer0_Routine() interrupt 1  //定时器0对应interrupt 1
//{
//	TMOD &= 0xF0;			//设置定时器模式
//	TMOD |= 0x01;			//设置定时器模式
//	Timer0Count++;    //每溢出一次记录 由于1ms溢出一次
//	if(Timer0Count==1000)  //时间为1s
//	{
//			|
//	}
//}